codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx151f128h.h
extern volatile __UDCONbits_t UDCONbits __asm__ ("UDCON") __attribute__((section("sfrs")));
extern volatile unsigned int        UDCONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        UDCONSET __attribute__((section("sfrs")));
extern volatile unsigned int        UDCONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CH0CON __attribute__((section("sfrs")));
typedef struct {
  unsigned DIFFGAIN:2;
  unsigned :2;
  unsigned LPFILTSEL:4;
  unsigned CVDEN:1;
  unsigned CHPRE:1;
  unsigned BIASEN:1;
  unsigned POLINV:1;
  unsigned DCAPSEL:2;
  unsigned :1;
  unsigned DCAPPWR:1;
  unsigned GRXPRE:1;
  unsigned GRXBIASEN:1;
  unsigned BUFSEL:1;
  unsigned :1;
  unsigned FILTRST:1;
  unsigned AUTOFRST:1;
  unsigned :2;
  unsigned BUFEN:1;
  unsigned RXFILTEN:1;
  unsigned :1;
  unsigned REFATTEN:1;
  unsigned REFFILTEN:1;
  unsigned :1;
  unsigned DIFFEN:1;
} __CH0CONbits_t;
extern volatile __CH0CONbits_t CH0CONbits __asm__ ("CH0CON") __attribute__((section("sfrs")));
extern volatile unsigned int        CH0CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CH0CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        CH0CONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CH1CON __attribute__((section("sfrs")));
typedef struct {
  unsigned DIFFGAIN:2;
  unsigned :2;
  unsigned LPFILTSEL:4;
  unsigned CVDEN:1;
  unsigned CHPRE:1;
  unsigned BIASEN:1;
  unsigned POLINV:1;
  unsigned DCAPSEL:2;
  unsigned :1;
  unsigned DCAPPWR:1;
  unsigned GRXPRE:1;
  unsigned GRXBIASEN:1;
  unsigned BUFSEL:1;
  unsigned :1;
  unsigned FILTRST:1;
  unsigned AUTOFRST:1;
  unsigned :2;
  unsigned BUFEN:1;
  unsigned RXFILTEN:1;
  unsigned :1;
  unsigned REFATTEN:1;
  unsigned REFFILTEN:1;
  unsigned :1;
  unsigned DIFFEN:1;
} __CH1CONbits_t;
extern volatile __CH1CONbits_t CH1CONbits __asm__ ("CH1CON") __attribute__((section("sfrs")));
extern volatile unsigned int        CH1CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CH1CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        CH1CONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CH2CON __attribute__((section("sfrs")));
typedef struct {
  unsigned DIFFGAIN:2;
  unsigned :2;
  unsigned LPFILTSEL:4;
  unsigned CVDEN:1;
  unsigned CHPRE:1;
  unsigned BIASEN:1;
  unsigned POLINV:1;
  unsigned DCAPSEL:2;
  unsigned :1;
  unsigned DCAPPWR:1;
  unsigned GRXPRE:1;
  unsigned GRXBIASEN:1;
  unsigned BUFSEL:1;
  unsigned :1;
  unsigned FILTRST:1;
  unsigned AUTOFRST:1;
  unsigned :2;
  unsigned BUFEN:1;
  unsigned RXFILTEN:1;
  unsigned :1;
  unsigned REFATTEN:1;
  unsigned REFFILTEN:1;
  unsigned :1;
  unsigned DIFFEN:1;
} __CH2CONbits_t;
extern volatile __CH2CONbits_t CH2CONbits __asm__ ("CH2CON") __attribute__((section("sfrs")));
extern volatile unsigned int        CH2CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CH2CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        CH2CONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CH3CON __attribute__((section("sfrs")));
typedef struct {
  unsigned DIFFGAIN:2;
  unsigned :2;
  unsigned LPFILTSEL:4;
  unsigned CVDEN:1;
  unsigned CHPRE:1;
  unsigned BIASEN:1;
  unsigned POLINV:1;
  unsigned DCAPSEL:2;
  unsigned :1;
  unsigned DCAPPWR:1;
  unsigned GRXPRE:1;
  unsigned GRXBIASEN:1;
  unsigned BUFSEL:1;
  unsigned :1;
  unsigned FILTRST:1;
  unsigned AUTOFRST:1;
  unsigned :2;
  unsigned BUFEN:1;
  unsigned RXFILTEN:1;
  unsigned :1;
  unsigned REFATTEN:1;
  unsigned REFFILTEN:1;
  unsigned :1;
  unsigned DIFFEN:1;
} __CH3CONbits_t;
extern volatile __CH3CONbits_t CH3CONbits __asm__ ("CH3CON") __attribute__((section("sfrs")));
extern volatile unsigned int        CH3CONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CH3CONSET __attribute__((section("sfrs")));
extern volatile unsigned int        CH3CONINV __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCON1 __attribute__((section("sfrs")));
typedef struct {
  unsigned :1;
  unsigned G_SAMP:1;
  unsigned G_ASAM:2;
  unsigned G_CLR_ASAM:1;
  unsigned G_SSRC:3;
  unsigned FORM:3;
  unsigned :1;
  unsigned DMABM:1;
  unsigned SIDL:1;
  unsigned FRZ:1;
  unsigned ON:1;
  unsigned G_EN:5;
  unsigned :3;
  unsigned RESIDX:3;
} __ADCOMCON1bits_t;
extern volatile __ADCOMCON1bits_t ADCOMCON1bits __asm__ ("ADCOMCON1") __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCON2 __attribute__((section("sfrs")));
typedef struct {
  unsigned :12;
  unsigned OFFCAL:1;
  unsigned VCFG:2;
} __ADCOMCON2bits_t;
extern volatile __ADCOMCON2bits_t ADCOMCON2bits __asm__ ("ADCOMCON2") __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCON2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCON2SET __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCON2INV __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCON3 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCS:8;
  unsigned G_SAMC:5;
  unsigned :1;
  unsigned ECLK:1;
  unsigned ADRC:1;
  unsigned RESET:1;
  unsigned CLKOE:1;
  unsigned :4;
  unsigned HOLD:1;
  unsigned CLKRDY:1;
  unsigned TSYNC:7;
} __ADCOMCON3bits_t;
extern volatile __ADCOMCON3bits_t ADCOMCON3bits __asm__ ("ADCOMCON3") __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCON3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCON3SET __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCON3INV __attribute__((section("sfrs")));
extern volatile unsigned int        AD0CON1 __attribute__((section("sfrs")));
typedef struct {
  unsigned DONE:1;
  unsigned SAMP:1;
  unsigned ASAM:2;
  unsigned CLR_ASAM:1;
  unsigned SSRC:3;
  unsigned :7;
  unsigned EN:1;
  unsigned SAMC:5;
  unsigned :3;
  unsigned SAMCV:5;
} __AD0CON1bits_t;
extern volatile __AD0CON1bits_t AD0CON1bits __asm__ ("AD0CON1") __attribute__((section("sfrs")));
extern volatile unsigned int        AD0CON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        AD0CON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        AD0CON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CON1 __attribute__((section("sfrs")));
typedef struct {
  unsigned DONE:1;
  unsigned SAMP:1;
  unsigned ASAM:2;
  unsigned CLR_ASAM:1;
  unsigned SSRC:3;
  unsigned :7;
  unsigned EN:1;
  unsigned SAMC:5;
  unsigned :3;
  unsigned SAMCV:5;
} __AD1CON1bits_t;
extern volatile __AD1CON1bits_t AD1CON1bits __asm__ ("AD1CON1") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        AD2CON1 __attribute__((section("sfrs")));
typedef struct {
  unsigned DONE:1;
  unsigned SAMP:1;
  unsigned ASAM:2;
  unsigned CLR_ASAM:1;
  unsigned SSRC:3;
  unsigned :7;
  unsigned EN:1;
  unsigned SAMC:5;
  unsigned :3;
  unsigned SAMCV:5;
} __AD2CON1bits_t;
