codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx151f128h.h
extern volatile __AD2CON1bits_t AD2CON1bits __asm__ ("AD2CON1") __attribute__((section("sfrs")));
extern volatile unsigned int        AD2CON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        AD2CON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        AD2CON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        AD3CON1 __attribute__((section("sfrs")));
typedef struct {
  unsigned DONE:1;
  unsigned SAMP:1;
  unsigned ASAM:2;
  unsigned CLR_ASAM:1;
  unsigned SSRC:3;
  unsigned :7;
  unsigned EN:1;
  unsigned SAMC:5;
  unsigned :3;
  unsigned SAMCV:5;
} __AD3CON1bits_t;
extern volatile __AD3CON1bits_t AD3CON1bits __asm__ ("AD3CON1") __attribute__((section("sfrs")));
extern volatile unsigned int        AD3CON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        AD3CON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        AD3CON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        AD4CON1 __attribute__((section("sfrs")));
typedef struct {
  unsigned DONE:1;
  unsigned SAMP:1;
  unsigned ASAM:2;
  unsigned CLR_ASAM:1;
  unsigned SSRC:3;
  unsigned :7;
  unsigned EN:1;
  unsigned SAMC:5;
  unsigned :3;
  unsigned SAMCV:5;
} __AD4CON1bits_t;
extern volatile __AD4CON1bits_t AD4CON1bits __asm__ ("AD4CON1") __attribute__((section("sfrs")));
extern volatile unsigned int        AD4CON1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        AD4CON1SET __attribute__((section("sfrs")));
extern volatile unsigned int        AD4CON1INV __attribute__((section("sfrs")));
extern volatile unsigned int        ADC0RESR __attribute__((section("sfrs")));
typedef struct {
  unsigned ADRES:32;
} __ADC0RESRbits_t;
extern volatile __ADC0RESRbits_t ADC0RESRbits __asm__ ("ADC0RESR") __attribute__((section("sfrs")));
extern volatile unsigned int        ADC0RESRCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ADC0RESRSET __attribute__((section("sfrs")));
extern volatile unsigned int        ADC0RESRINV __attribute__((section("sfrs")));
extern volatile unsigned int        ADC1RESR __attribute__((section("sfrs")));
typedef struct {
  unsigned ADRES:32;
} __ADC1RESRbits_t;
extern volatile __ADC1RESRbits_t ADC1RESRbits __asm__ ("ADC1RESR") __attribute__((section("sfrs")));
extern volatile unsigned int        ADC1RESRCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ADC1RESRSET __attribute__((section("sfrs")));
extern volatile unsigned int        ADC1RESRINV __attribute__((section("sfrs")));
extern volatile unsigned int        ADC2RESR __attribute__((section("sfrs")));
typedef struct {
  unsigned ADRES:32;
} __ADC2RESRbits_t;
extern volatile __ADC2RESRbits_t ADC2RESRbits __asm__ ("ADC2RESR") __attribute__((section("sfrs")));
extern volatile unsigned int        ADC2RESRCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ADC2RESRSET __attribute__((section("sfrs")));
extern volatile unsigned int        ADC2RESRINV __attribute__((section("sfrs")));
extern volatile unsigned int        ADC3RESR __attribute__((section("sfrs")));
typedef struct {
  unsigned ADRES:32;
} __ADC3RESRbits_t;
extern volatile __ADC3RESRbits_t ADC3RESRbits __asm__ ("ADC3RESR") __attribute__((section("sfrs")));
extern volatile unsigned int        ADC3RESRCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ADC3RESRSET __attribute__((section("sfrs")));
extern volatile unsigned int        ADC3RESRINV __attribute__((section("sfrs")));
extern volatile unsigned int        ADC4RESR __attribute__((section("sfrs")));
typedef struct {
  unsigned ADRES:32;
} __ADC4RESRbits_t;
extern volatile __ADC4RESRbits_t ADC4RESRbits __asm__ ("ADC4RESR") __attribute__((section("sfrs")));
extern volatile unsigned int        ADC4RESRCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ADC4RESRSET __attribute__((section("sfrs")));
extern volatile unsigned int        ADC4RESRINV __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCHS __attribute__((section("sfrs")));
typedef struct {
  unsigned AD0CHS:2;
  unsigned :2;
  unsigned AD1CHS:2;
  unsigned :2;
  unsigned AD2CHS:2;
  unsigned :2;
  unsigned AD3CHS:2;
  unsigned :2;
  unsigned AD4CHS:2;
} __ADCOMCHSbits_t;
extern volatile __ADCOMCHSbits_t ADCOMCHSbits __asm__ ("ADCOMCHS") __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCHSCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCHSSET __attribute__((section("sfrs")));
extern volatile unsigned int        ADCOMCHSINV __attribute__((section("sfrs")));
extern volatile unsigned int        CICCON __attribute__((section("sfrs")));
typedef struct {
  unsigned SHIFT:5;
  unsigned :3;
  unsigned ORDER:1;
  unsigned :2;
  unsigned MODE:1;
  unsigned :1;
  unsigned SIDL:1;
  unsigned FRZ:1;
  unsigned ON:1;
  unsigned EN:5;
  unsigned :3;
  unsigned DLEN:1;
  unsigned DINT:1;
  unsigned DMAEN:1;
  unsigned RESET:1;
  unsigned UPDATE:1;
  unsigned DEMODEN:1;
  unsigned POLS:1;
  unsigned SOURCE:1;
} __CICCONbits_t;
extern volatile __CICCONbits_t CICCONbits __asm__ ("CICCON") __attribute__((section("sfrs")));
extern volatile unsigned int        CICCONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CICCONSET __attribute__((section("sfrs")));
extern volatile unsigned int        CICCONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CICLEN __attribute__((section("sfrs")));
typedef struct {
  unsigned LEN1:12;
  unsigned :4;
  unsigned LEN2:12;
} __CICLENbits_t;
extern volatile __CICLENbits_t CICLENbits __asm__ ("CICLEN") __attribute__((section("sfrs")));
extern volatile unsigned int        CICLENCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CICLENSET __attribute__((section("sfrs")));
extern volatile unsigned int        CICLENINV __attribute__((section("sfrs")));
extern volatile unsigned int        FISCON __attribute__((section("sfrs")));
typedef struct {
  unsigned TLOW:16;
  unsigned THIGH:16;
} __FISCONbits_t;
extern volatile __FISCONbits_t FISCONbits __asm__ ("FISCON") __attribute__((section("sfrs")));
extern volatile unsigned int        FISCONCLR __attribute__((section("sfrs")));
extern volatile unsigned int        FISCONSET __attribute__((section("sfrs")));
extern volatile unsigned int        FISCONINV __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN0 __attribute__((section("sfrs")));
typedef struct {
  unsigned CICIN:16;
} __CICIN0bits_t;
extern volatile __CICIN0bits_t CICIN0bits __asm__ ("CICIN0") __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN0SET __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN0INV __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN1 __attribute__((section("sfrs")));
typedef struct {
  unsigned CICIN:16;
} __CICIN1bits_t;
extern volatile __CICIN1bits_t CICIN1bits __asm__ ("CICIN1") __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN1SET __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN1INV __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN2 __attribute__((section("sfrs")));
typedef struct {
  unsigned CICIN:16;
} __CICIN2bits_t;
extern volatile __CICIN2bits_t CICIN2bits __asm__ ("CICIN2") __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN2SET __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN2INV __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN3 __attribute__((section("sfrs")));
typedef struct {
  unsigned CICIN:16;
} __CICIN3bits_t;
extern volatile __CICIN3bits_t CICIN3bits __asm__ ("CICIN3") __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN3SET __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN3INV __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN4 __attribute__((section("sfrs")));
typedef struct {
  unsigned CICIN:16;
} __CICIN4bits_t;
extern volatile __CICIN4bits_t CICIN4bits __asm__ ("CICIN4") __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN4CLR __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN4SET __attribute__((section("sfrs")));
extern volatile unsigned int        CICIN4INV __attribute__((section("sfrs")));
extern volatile unsigned int        CICSTAT __attribute__((section("sfrs")));
typedef struct {
  unsigned COUNT:12;
  unsigned :4;
  unsigned DONE:1;
  unsigned BUSY:1;
  unsigned POLARITY:1;
  unsigned CURLEN:1;
  unsigned DMAFISCH:3;
  unsigned :1;
  unsigned DMAOUTCH:3;
  unsigned :1;
  unsigned DMAINCH:3;
} __CICSTATbits_t;
extern volatile __CICSTATbits_t CICSTATbits __asm__ ("CICSTAT") __attribute__((section("sfrs")));
extern volatile unsigned int        CICSTATCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CICSTATSET __attribute__((section("sfrs")));
extern volatile unsigned int        CICSTATINV __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT0 __attribute__((section("sfrs")));
typedef struct {
  unsigned LFIS0:12;
  unsigned :4;
  unsigned HFIS0:12;
} __FISSTAT0bits_t;
extern volatile __FISSTAT0bits_t FISSTAT0bits __asm__ ("FISSTAT0") __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT0SET __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT0INV __attribute__((section("sfrs")));
extern volatile unsigned int        FISSTAT1 __attribute__((section("sfrs")));
typedef struct {
  unsigned LFIS1:12;
  unsigned :4;
  unsigned HFIS1:12;
} __FISSTAT1bits_t;
