codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx151f128h.h
extern volatile __IOCPDBbits_t IOCPDBbits __asm__ ("IOCPDB") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPDBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPDBSET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPDBINV __attribute__((section("sfrs")));
extern volatile unsigned int        IOCCONB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __IOCCONBbits_t;
extern volatile __IOCCONBbits_t IOCCONBbits __asm__ ("IOCCONB") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCCONBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCCONBSET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCCONBINV __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIEB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned IOCIEB0:1;
    unsigned IOCIEB1:1;
    unsigned IOCIEB2:1;
    unsigned IOCIEB3:1;
    unsigned IOCIEB4:1;
    unsigned IOCIEB5:1;
    unsigned :1;
    unsigned IOCIEB7:1;
    unsigned IOCIEB8:1;
    unsigned IOCIEB9:1;
    unsigned IOCIEB10:1;
    unsigned IOCIEB11:1;
    unsigned :1;
    unsigned IOCIEB13:1;
    unsigned IOCIEB14:1;
    unsigned IOCIEB15:1;
  };
  struct {
    unsigned w:32;
  };
} __IOCIEBbits_t;
extern volatile __IOCIEBbits_t IOCIEBbits __asm__ ("IOCIEB") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIEBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIEBSET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIEBINV __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIFB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned IOCIFB0:1;
    unsigned IOCIFB1:1;
    unsigned IOCIFB2:1;
    unsigned IOCIFB3:1;
    unsigned IOCIFB4:1;
    unsigned IOCIFB5:1;
    unsigned :1;
    unsigned IOCIFB7:1;
    unsigned IOCIFB8:1;
    unsigned IOCIFB9:1;
    unsigned IOCIFB10:1;
    unsigned IOCIFB11:1;
    unsigned :1;
    unsigned IOCIFB13:1;
    unsigned IOCIFB14:1;
    unsigned IOCIFB15:1;
  };
  struct {
    unsigned w:32;
  };
} __IOCIFBbits_t;
extern volatile __IOCIFBbits_t IOCIFBbits __asm__ ("IOCIFB") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIFBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIFBSET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIFBINV __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ANSC0:1;
    unsigned ANSC1:1;
    unsigned ANSC2:1;
    unsigned ANSC3:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELCbits_t;
extern volatile __ANSELCbits_t ANSELCbits __asm__ ("ANSELC") __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELCCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELCSET __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELCINV __attribute__((section("sfrs")));
extern volatile unsigned int        TRISC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISC0:1;
    unsigned TRISC1:1;
    unsigned TRISC2:1;
    unsigned TRISC3:1;
    unsigned TRISC4:1;
    unsigned TRISC5:1;
    unsigned TRISC6:1;
    unsigned TRISC7:1;
    unsigned TRISC8:1;
    unsigned TRISC9:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISCbits_t;
extern volatile __TRISCbits_t TRISCbits __asm__ ("TRISC") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISCCLR __attribute__((section("sfrs")));
extern volatile unsigned int        TRISCSET __attribute__((section("sfrs")));
extern volatile unsigned int        TRISCINV __attribute__((section("sfrs")));
extern volatile unsigned int        PORTC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RC0:1;
    unsigned RC1:1;
    unsigned RC2:1;
    unsigned RC3:1;
    unsigned RC4:1;
    unsigned RC5:1;
    unsigned RC6:1;
    unsigned RC7:1;
    unsigned RC8:1;
    unsigned RC9:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTCbits_t;
extern volatile __PORTCbits_t PORTCbits __asm__ ("PORTC") __attribute__((section("sfrs")));
extern volatile unsigned int        PORTCCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PORTCSET __attribute__((section("sfrs")));
extern volatile unsigned int        PORTCINV __attribute__((section("sfrs")));
extern volatile unsigned int        LATC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATC0:1;
    unsigned LATC1:1;
    unsigned LATC2:1;
    unsigned LATC3:1;
    unsigned LATC4:1;
    unsigned LATC5:1;
    unsigned LATC6:1;
    unsigned LATC7:1;
    unsigned LATC8:1;
    unsigned LATC9:1;
  };
  struct {
    unsigned w:32;
  };
} __LATCbits_t;
extern volatile __LATCbits_t LATCbits __asm__ ("LATC") __attribute__((section("sfrs")));
extern volatile unsigned int        LATCCLR __attribute__((section("sfrs")));
extern volatile unsigned int        LATCSET __attribute__((section("sfrs")));
extern volatile unsigned int        LATCINV __attribute__((section("sfrs")));
extern volatile unsigned int        ODCC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :4;
    unsigned ODCC4:1;
    unsigned ODCC5:1;
    unsigned ODCC6:1;
    unsigned ODCC7:1;
    unsigned ODCC8:1;
    unsigned ODCC9:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCCbits_t;
extern volatile __ODCCbits_t ODCCbits __asm__ ("ODCC") __attribute__((section("sfrs")));
extern volatile unsigned int        ODCCCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ODCCSET __attribute__((section("sfrs")));
extern volatile unsigned int        ODCCINV __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPUC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned IOCPUC0:1;
    unsigned IOCPUC1:1;
    unsigned IOCPUC2:1;
    unsigned IOCPUC3:1;
    unsigned IOCPUC4:1;
    unsigned IOCPUC5:1;
    unsigned IOCPUC6:1;
    unsigned IOCPUC7:1;
    unsigned IOCPUC8:1;
    unsigned IOCPUC9:1;
  };
  struct {
    unsigned w:32;
  };
} __IOCPUCbits_t;
extern volatile __IOCPUCbits_t IOCPUCbits __asm__ ("IOCPUC") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPUCCLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPUCSET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPUCINV __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPDC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned IOCPDC0:1;
    unsigned IOCPDC1:1;
    unsigned IOCPDC2:1;
    unsigned IOCPDC3:1;
    unsigned IOCPDC4:1;
    unsigned IOCPDC5:1;
    unsigned IOCPDC6:1;
    unsigned IOCPDC7:1;
    unsigned IOCPDC8:1;
    unsigned IOCPDC9:1;
  };
  struct {
    unsigned w:32;
  };
} __IOCPDCbits_t;
