codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx151f128h.h
  .extern DCH4CPTRSET      /* 0xBF883408 */
  .extern DCH4CPTRINV      /* 0xBF88340C */
  .extern DCH4DAT          /* 0xBF883410 */
  .extern DCH4DATCLR       /* 0xBF883414 */
  .extern DCH4DATSET       /* 0xBF883418 */
  .extern DCH4DATINV       /* 0xBF88341C */
  .extern DCH5CON          /* 0xBF883420 */
  .extern DCH5CONCLR       /* 0xBF883424 */
  .extern DCH5CONSET       /* 0xBF883428 */
  .extern DCH5CONINV       /* 0xBF88342C */
  .extern DCH5ECON         /* 0xBF883430 */
  .extern DCH5ECONCLR      /* 0xBF883434 */
  .extern DCH5ECONSET      /* 0xBF883438 */
  .extern DCH5ECONINV      /* 0xBF88343C */
  .extern DCH5INT          /* 0xBF883440 */
  .extern DCH5INTCLR       /* 0xBF883444 */
  .extern DCH5INTSET       /* 0xBF883448 */
  .extern DCH5INTINV       /* 0xBF88344C */
  .extern DCH5SSA          /* 0xBF883450 */
  .extern DCH5SSACLR       /* 0xBF883454 */
  .extern DCH5SSASET       /* 0xBF883458 */
  .extern DCH5SSAINV       /* 0xBF88345C */
  .extern DCH5DSA          /* 0xBF883460 */
  .extern DCH5DSACLR       /* 0xBF883464 */
  .extern DCH5DSASET       /* 0xBF883468 */
  .extern DCH5DSAINV       /* 0xBF88346C */
  .extern DCH5SSIZ         /* 0xBF883470 */
  .extern DCH5SSIZCLR      /* 0xBF883474 */
  .extern DCH5SSIZSET      /* 0xBF883478 */
  .extern DCH5SSIZINV      /* 0xBF88347C */
  .extern DCH5DSIZ         /* 0xBF883480 */
  .extern DCH5DSIZCLR      /* 0xBF883484 */
  .extern DCH5DSIZSET      /* 0xBF883488 */
  .extern DCH5DSIZINV      /* 0xBF88348C */
  .extern DCH5SPTR         /* 0xBF883490 */
  .extern DCH5SPTRCLR      /* 0xBF883494 */
  .extern DCH5SPTRSET      /* 0xBF883498 */
  .extern DCH5SPTRINV      /* 0xBF88349C */
  .extern DCH5DPTR         /* 0xBF8834A0 */
  .extern DCH5DPTRCLR      /* 0xBF8834A4 */
  .extern DCH5DPTRSET      /* 0xBF8834A8 */
  .extern DCH5DPTRINV      /* 0xBF8834AC */
  .extern DCH5CSIZ         /* 0xBF8834B0 */
  .extern DCH5CSIZCLR      /* 0xBF8834B4 */
  .extern DCH5CSIZSET      /* 0xBF8834B8 */
  .extern DCH5CSIZINV      /* 0xBF8834BC */
  .extern DCH5CPTR         /* 0xBF8834C0 */
  .extern DCH5CPTRCLR      /* 0xBF8834C4 */
  .extern DCH5CPTRSET      /* 0xBF8834C8 */
  .extern DCH5CPTRINV      /* 0xBF8834CC */
  .extern DCH5DAT          /* 0xBF8834D0 */
  .extern DCH5DATCLR       /* 0xBF8834D4 */
  .extern DCH5DATSET       /* 0xBF8834D8 */
  .extern DCH5DATINV       /* 0xBF8834DC */
  .extern DCH6CON          /* 0xBF8834E0 */
  .extern DCH6CONCLR       /* 0xBF8834E4 */
  .extern DCH6CONSET       /* 0xBF8834E8 */
  .extern DCH6CONINV       /* 0xBF8834EC */
  .extern DCH6ECON         /* 0xBF8834F0 */
  .extern DCH6ECONCLR      /* 0xBF8834F4 */
  .extern DCH6ECONSET      /* 0xBF8834F8 */
  .extern DCH6ECONINV      /* 0xBF8834FC */
  .extern DCH6INT          /* 0xBF883500 */
  .extern DCH6INTCLR       /* 0xBF883504 */
  .extern DCH6INTSET       /* 0xBF883508 */
  .extern DCH6INTINV       /* 0xBF88350C */
  .extern DCH6SSA          /* 0xBF883510 */
  .extern DCH6SSACLR       /* 0xBF883514 */
  .extern DCH6SSASET       /* 0xBF883518 */
  .extern DCH6SSAINV       /* 0xBF88351C */
  .extern DCH6DSA          /* 0xBF883520 */
  .extern DCH6DSACLR       /* 0xBF883524 */
  .extern DCH6DSASET       /* 0xBF883528 */
  .extern DCH6DSAINV       /* 0xBF88352C */
  .extern DCH6SSIZ         /* 0xBF883530 */
  .extern DCH6SSIZCLR      /* 0xBF883534 */
  .extern DCH6SSIZSET      /* 0xBF883538 */
  .extern DCH6SSIZINV      /* 0xBF88353C */
  .extern DCH6DSIZ         /* 0xBF883540 */
  .extern DCH6DSIZCLR      /* 0xBF883544 */
  .extern DCH6DSIZSET      /* 0xBF883548 */
  .extern DCH6DSIZINV      /* 0xBF88354C */
  .extern DCH6SPTR         /* 0xBF883550 */
  .extern DCH6SPTRCLR      /* 0xBF883554 */
  .extern DCH6SPTRSET      /* 0xBF883558 */
  .extern DCH6SPTRINV      /* 0xBF88355C */
  .extern DCH6DPTR         /* 0xBF883560 */
  .extern DCH6DPTRCLR      /* 0xBF883564 */
  .extern DCH6DPTRSET      /* 0xBF883568 */
  .extern DCH6DPTRINV      /* 0xBF88356C */
  .extern DCH6CSIZ         /* 0xBF883570 */
  .extern DCH6CSIZCLR      /* 0xBF883574 */
  .extern DCH6CSIZSET      /* 0xBF883578 */
  .extern DCH6CSIZINV      /* 0xBF88357C */
  .extern DCH6CPTR         /* 0xBF883580 */
  .extern DCH6CPTRCLR      /* 0xBF883584 */
  .extern DCH6CPTRSET      /* 0xBF883588 */
  .extern DCH6CPTRINV      /* 0xBF88358C */
  .extern DCH6DAT          /* 0xBF883590 */
  .extern DCH6DATCLR       /* 0xBF883594 */
  .extern DCH6DATSET       /* 0xBF883598 */
  .extern DCH6DATINV       /* 0xBF88359C */
  .extern DCH7CON          /* 0xBF8835A0 */
  .extern DCH7CONCLR       /* 0xBF8835A4 */
  .extern DCH7CONSET       /* 0xBF8835A8 */
  .extern DCH7CONINV       /* 0xBF8835AC */
  .extern DCH7ECON         /* 0xBF8835B0 */
  .extern DCH7ECONCLR      /* 0xBF8835B4 */
  .extern DCH7ECONSET      /* 0xBF8835B8 */
  .extern DCH7ECONINV      /* 0xBF8835BC */
  .extern DCH7INT          /* 0xBF8835C0 */
  .extern DCH7INTCLR       /* 0xBF8835C4 */
  .extern DCH7INTSET       /* 0xBF8835C8 */
  .extern DCH7INTINV       /* 0xBF8835CC */
  .extern DCH7SSA          /* 0xBF8835D0 */
  .extern DCH7SSACLR       /* 0xBF8835D4 */
  .extern DCH7SSASET       /* 0xBF8835D8 */
  .extern DCH7SSAINV       /* 0xBF8835DC */
  .extern DCH7DSA          /* 0xBF8835E0 */
  .extern DCH7DSACLR       /* 0xBF8835E4 */
  .extern DCH7DSASET       /* 0xBF8835E8 */
  .extern DCH7DSAINV       /* 0xBF8835EC */
  .extern DCH7SSIZ         /* 0xBF8835F0 */
  .extern DCH7SSIZCLR      /* 0xBF8835F4 */
  .extern DCH7SSIZSET      /* 0xBF8835F8 */
  .extern DCH7SSIZINV      /* 0xBF8835FC */
  .extern DCH7DSIZ         /* 0xBF883600 */
  .extern DCH7DSIZCLR      /* 0xBF883604 */
  .extern DCH7DSIZSET      /* 0xBF883608 */
  .extern DCH7DSIZINV      /* 0xBF88360C */
  .extern DCH7SPTR         /* 0xBF883610 */
  .extern DCH7SPTRCLR      /* 0xBF883614 */
  .extern DCH7SPTRSET      /* 0xBF883618 */
  .extern DCH7SPTRINV      /* 0xBF88361C */
  .extern DCH7DPTR         /* 0xBF883620 */
  .extern DCH7DPTRCLR      /* 0xBF883624 */
  .extern DCH7DPTRSET      /* 0xBF883628 */
  .extern DCH7DPTRINV      /* 0xBF88362C */
  .extern DCH7CSIZ         /* 0xBF883630 */
  .extern DCH7CSIZCLR      /* 0xBF883634 */
  .extern DCH7CSIZSET      /* 0xBF883638 */
  .extern DCH7CSIZINV      /* 0xBF88363C */
  .extern DCH7CPTR         /* 0xBF883640 */
  .extern DCH7CPTRCLR      /* 0xBF883644 */
  .extern DCH7CPTRSET      /* 0xBF883648 */
  .extern DCH7CPTRINV      /* 0xBF88364C */
  .extern DCH7DAT          /* 0xBF883650 */
  .extern DCH7DATCLR       /* 0xBF883654 */
  .extern DCH7DATSET       /* 0xBF883658 */
  .extern DCH7DATINV       /* 0xBF88365C */
  .extern U1OTGIR          /* 0xBF885220 */
  .extern U1OTGIRCLR       /* 0xBF885224 */
  .extern U1OTGIE          /* 0xBF885230 */
  .extern U1OTGIECLR       /* 0xBF885234 */
  .extern U1OTGIESET       /* 0xBF885238 */
  .extern U1OTGIEINV       /* 0xBF88523C */
  .extern U1OTGSTAT        /* 0xBF885240 */
  .extern U1OTGCON         /* 0xBF885250 */
  .extern U1OTGCONCLR      /* 0xBF885254 */
  .extern U1OTGCONSET      /* 0xBF885258 */
  .extern U1OTGCONINV      /* 0xBF88525C */
  .extern U1PWRC           /* 0xBF885260 */
  .extern U1PWRCCLR        /* 0xBF885264 */
  .extern U1PWRCSET        /* 0xBF885268 */
  .extern U1PWRCINV        /* 0xBF88526C */
  .extern U1IR             /* 0xBF8853E0 */
  .extern U1IRCLR          /* 0xBF8853E4 */
  .extern U1IE             /* 0xBF8853F0 */
  .extern U1IECLR          /* 0xBF8853F4 */
  .extern U1IESET          /* 0xBF8853F8 */
  .extern U1IEINV          /* 0xBF8853FC */
  .extern U1EIR            /* 0xBF885400 */
  .extern U1EIRCLR         /* 0xBF885404 */
  .extern U1EIE            /* 0xBF885410 */
  .extern U1EIECLR         /* 0xBF885414 */
  .extern U1EIESET         /* 0xBF885418 */
  .extern U1EIEINV         /* 0xBF88541C */
  .extern U1STAT           /* 0xBF885420 */
  .extern U1CON            /* 0xBF885430 */
  .extern U1CONCLR         /* 0xBF885434 */
  .extern U1CONSET         /* 0xBF885438 */
  .extern U1CONINV         /* 0xBF88543C */
  .extern U1ADDR           /* 0xBF885440 */
  .extern U1ADDRCLR        /* 0xBF885444 */
  .extern U1ADDRSET        /* 0xBF885448 */
  .extern U1ADDRINV        /* 0xBF88544C */
  .extern U1BDTP1          /* 0xBF885450 */
  .extern U1BDTP1CLR       /* 0xBF885454 */
  .extern U1BDTP1SET       /* 0xBF885458 */
  .extern U1BDTP1INV       /* 0xBF88545C */
  .extern U1FRML           /* 0xBF885460 */
  .extern U1FRMH           /* 0xBF885470 */
  .extern U1TOK            /* 0xBF885480 */
  .extern U1TOKCLR         /* 0xBF885484 */
  .extern U1TOKSET         /* 0xBF885488 */
  .extern U1TOKINV         /* 0xBF88548C */
  .extern U1SOF            /* 0xBF885490 */
  .extern U1SOFCLR         /* 0xBF885494 */
  .extern U1SOFSET         /* 0xBF885498 */
  .extern U1SOFINV         /* 0xBF88549C */
  .extern U1BDTP2          /* 0xBF8854A0 */
  .extern U1BDTP2CLR       /* 0xBF8854A4 */
  .extern U1BDTP2SET       /* 0xBF8854A8 */
  .extern U1BDTP2INV       /* 0xBF8854AC */
  .extern U1BDTP3          /* 0xBF8854B0 */
  .extern U1BDTP3CLR       /* 0xBF8854B4 */
  .extern U1BDTP3SET       /* 0xBF8854B8 */
  .extern U1BDTP3INV       /* 0xBF8854BC */
  .extern U1CNFG1          /* 0xBF8854C0 */
  .extern U1CNFG1CLR       /* 0xBF8854C4 */
  .extern U1CNFG1SET       /* 0xBF8854C8 */
  .extern U1CNFG1INV       /* 0xBF8854CC */
  .extern U1EP0            /* 0xBF8854E0 */
  .extern U1EP0CLR         /* 0xBF8854E4 */
  .extern U1EP0SET         /* 0xBF8854E8 */
  .extern U1EP0INV         /* 0xBF8854EC */
  .extern U1EP1            /* 0xBF8854F0 */
  .extern U1EP1CLR         /* 0xBF8854F4 */
  .extern U1EP1SET         /* 0xBF8854F8 */
  .extern U1EP1INV         /* 0xBF8854FC */
  .extern U1EP2            /* 0xBF885500 */
  .extern U1EP2CLR         /* 0xBF885504 */
  .extern U1EP2SET         /* 0xBF885508 */
  .extern U1EP2INV         /* 0xBF88550C */
  .extern U1EP3            /* 0xBF885510 */
  .extern U1EP3CLR         /* 0xBF885514 */
  .extern U1EP3SET         /* 0xBF885518 */
  .extern U1EP3INV         /* 0xBF88551C */
  .extern U1EP4            /* 0xBF885520 */
  .extern U1EP4CLR         /* 0xBF885524 */
  .extern U1EP4SET         /* 0xBF885528 */
  .extern U1EP4INV         /* 0xBF88552C */
  .extern U1EP5            /* 0xBF885530 */
  .extern U1EP5CLR         /* 0xBF885534 */
  .extern U1EP5SET         /* 0xBF885538 */
  .extern U1EP5INV         /* 0xBF88553C */
  .extern U1EP6            /* 0xBF885540 */
  .extern U1EP6CLR         /* 0xBF885544 */
  .extern U1EP6SET         /* 0xBF885548 */
  .extern U1EP6INV         /* 0xBF88554C */
  .extern U1EP7            /* 0xBF885550 */
  .extern U1EP7CLR         /* 0xBF885554 */
  .extern U1EP7SET         /* 0xBF885558 */
  .extern U1EP7INV         /* 0xBF88555C */
  .extern U1EP8            /* 0xBF885560 */
  .extern U1EP8CLR         /* 0xBF885564 */
  .extern U1EP8SET         /* 0xBF885568 */
  .extern U1EP8INV         /* 0xBF88556C */
  .extern U1EP9            /* 0xBF885570 */
  .extern U1EP9CLR         /* 0xBF885574 */
  .extern U1EP9SET         /* 0xBF885578 */
  .extern U1EP9INV         /* 0xBF88557C */
  .extern U1EP10           /* 0xBF885580 */
  .extern U1EP10CLR        /* 0xBF885584 */
  .extern U1EP10SET        /* 0xBF885588 */
  .extern U1EP10INV        /* 0xBF88558C */
  .extern U1EP11           /* 0xBF885590 */
  .extern U1EP11CLR        /* 0xBF885594 */
  .extern U1EP11SET        /* 0xBF885598 */
  .extern U1EP11INV        /* 0xBF88559C */
  .extern U1EP12           /* 0xBF8855A0 */
  .extern U1EP12CLR        /* 0xBF8855A4 */
  .extern U1EP12SET        /* 0xBF8855A8 */
  .extern U1EP12INV        /* 0xBF8855AC */
  .extern U1EP13           /* 0xBF8855B0 */
  .extern U1EP13CLR        /* 0xBF8855B4 */
  .extern U1EP13SET        /* 0xBF8855B8 */
  .extern U1EP13INV        /* 0xBF8855BC */
  .extern U1EP14           /* 0xBF8855C0 */
  .extern U1EP14CLR        /* 0xBF8855C4 */
  .extern U1EP14SET        /* 0xBF8855C8 */
  .extern U1EP14INV        /* 0xBF8855CC */
  .extern U1EP15           /* 0xBF8855D0 */
  .extern U1EP15CLR        /* 0xBF8855D4 */
  .extern U1EP15SET        /* 0xBF8855D8 */
  .extern U1EP15INV        /* 0xBF8855DC */
  .extern ANSELA           /* 0xBF8861E0 */
  .extern ANSELACLR        /* 0xBF8861E4 */
  .extern ANSELASET        /* 0xBF8861E8 */
  .extern ANSELAINV        /* 0xBF8861EC */
  .extern TRISA            /* 0xBF8861F0 */
  .extern TRISACLR         /* 0xBF8861F4 */
  .extern TRISASET         /* 0xBF8861F8 */
  .extern TRISAINV         /* 0xBF8861FC */
  .extern PORTA            /* 0xBF886200 */
  .extern PORTACLR         /* 0xBF886204 */
  .extern PORTASET         /* 0xBF886208 */
  .extern PORTAINV         /* 0xBF88620C */
  .extern LATA             /* 0xBF886210 */
  .extern LATACLR          /* 0xBF886214 */
  .extern LATASET          /* 0xBF886218 */
  .extern LATAINV          /* 0xBF88621C */
  .extern ODCA             /* 0xBF886220 */
  .extern ODCACLR          /* 0xBF886224 */
  .extern ODCASET          /* 0xBF886228 */
  .extern ODCAINV          /* 0xBF88622C */
  .extern IOCPUA           /* 0xBF886230 */
  .extern IOCPUACLR        /* 0xBF886234 */
  .extern IOCPUASET        /* 0xBF886238 */
  .extern IOCPUAINV        /* 0xBF88623C */
  .extern IOCPDA           /* 0xBF886240 */
  .extern IOCPDACLR        /* 0xBF886244 */
  .extern IOCPDASET        /* 0xBF886248 */
  .extern IOCPDAINV        /* 0xBF88624C */
  .extern IOCCONA          /* 0xBF886250 */
  .extern IOCCONACLR       /* 0xBF886254 */
  .extern IOCCONASET       /* 0xBF886258 */
  .extern IOCCONAINV       /* 0xBF88625C */
  .extern IOCIEA           /* 0xBF886260 */
  .extern IOCIEACLR        /* 0xBF886264 */
  .extern IOCIEASET        /* 0xBF886268 */
  .extern IOCIEAINV        /* 0xBF88626C */
  .extern IOCIFA           /* 0xBF886270 */
  .extern IOCIFACLR        /* 0xBF886274 */
  .extern IOCIFASET        /* 0xBF886278 */
  .extern IOCIFAINV        /* 0xBF88627C */
  .extern ANSELB           /* 0xBF8862E0 */
  .extern ANSELBCLR        /* 0xBF8862E4 */
  .extern ANSELBSET        /* 0xBF8862E8 */
  .extern ANSELBINV        /* 0xBF8862EC */
  .extern TRISB            /* 0xBF8862F0 */
  .extern TRISBCLR         /* 0xBF8862F4 */
  .extern TRISBSET         /* 0xBF8862F8 */
  .extern TRISBINV         /* 0xBF8862FC */
  .extern PORTB            /* 0xBF886300 */
  .extern PORTBCLR         /* 0xBF886304 */
  .extern PORTBSET         /* 0xBF886308 */
  .extern PORTBINV         /* 0xBF88630C */
  .extern LATB             /* 0xBF886310 */
  .extern LATBCLR          /* 0xBF886314 */
  .extern LATBSET          /* 0xBF886318 */
  .extern LATBINV          /* 0xBF88631C */
  .extern ODCB             /* 0xBF886320 */
  .extern ODCBCLR          /* 0xBF886324 */
  .extern ODCBSET          /* 0xBF886328 */
  .extern ODCBINV          /* 0xBF88632C */
  .extern IOCPUB           /* 0xBF886330 */
  .extern IOCPUBCLR        /* 0xBF886334 */
  .extern IOCPUBSET        /* 0xBF886338 */
  .extern IOCPUBINV        /* 0xBF88633C */
  .extern IOCPDB           /* 0xBF886340 */
  .extern IOCPDBCLR        /* 0xBF886344 */
  .extern IOCPDBSET        /* 0xBF886348 */
  .extern IOCPDBINV        /* 0xBF88634C */
  .extern IOCCONB          /* 0xBF886350 */
  .extern IOCCONBCLR       /* 0xBF886354 */
  .extern IOCCONBSET       /* 0xBF886358 */
  .extern IOCCONBINV       /* 0xBF88635C */
  .extern IOCIEB           /* 0xBF886360 */
  .extern IOCIEBCLR        /* 0xBF886364 */
  .extern IOCIEBSET        /* 0xBF886368 */
  .extern IOCIEBINV        /* 0xBF88636C */
  .extern IOCIFB           /* 0xBF886370 */
  .extern IOCIFBCLR        /* 0xBF886374 */
  .extern IOCIFBSET        /* 0xBF886378 */
  .extern IOCIFBINV        /* 0xBF88637C */
  .extern ANSELC           /* 0xBF8863E0 */
  .extern ANSELCCLR        /* 0xBF8863E4 */
  .extern ANSELCSET        /* 0xBF8863E8 */
  .extern ANSELCINV        /* 0xBF8863EC */
  .extern TRISC            /* 0xBF8863F0 */
  .extern TRISCCLR         /* 0xBF8863F4 */
  .extern TRISCSET         /* 0xBF8863F8 */
  .extern TRISCINV         /* 0xBF8863FC */
  .extern PORTC            /* 0xBF886400 */
  .extern PORTCCLR         /* 0xBF886404 */
  .extern PORTCSET         /* 0xBF886408 */
  .extern PORTCINV         /* 0xBF88640C */
  .extern LATC             /* 0xBF886410 */
  .extern LATCCLR          /* 0xBF886414 */
  .extern LATCSET          /* 0xBF886418 */
  .extern LATCINV          /* 0xBF88641C */
  .extern ODCC             /* 0xBF886420 */
  .extern ODCCCLR          /* 0xBF886424 */
  .extern ODCCSET          /* 0xBF886428 */
  .extern ODCCINV          /* 0xBF88642C */
  .extern IOCPUC           /* 0xBF886430 */
  .extern IOCPUCCLR        /* 0xBF886434 */
  .extern IOCPUCSET        /* 0xBF886438 */
  .extern IOCPUCINV        /* 0xBF88643C */
  .extern IOCPDC           /* 0xBF886440 */
  .extern IOCPDCCLR        /* 0xBF886444 */
  .extern IOCPDCSET        /* 0xBF886448 */
  .extern IOCPDCINV        /* 0xBF88644C */
  .extern IOCCONC          /* 0xBF886450 */
  .extern IOCCONCCLR       /* 0xBF886454 */
  .extern IOCCONCSET       /* 0xBF886458 */
  .extern IOCCONCINV       /* 0xBF88645C */
  .extern IOCIEC           /* 0xBF886460 */
  .extern IOCIECCLR        /* 0xBF886464 */
  .extern IOCIECSET        /* 0xBF886468 */
  .extern IOCIECINV        /* 0xBF88646C */
  .extern IOCIFC           /* 0xBF886470 */
  .extern IOCIFCCLR        /* 0xBF886474 */
  .extern IOCIFCSET        /* 0xBF886478 */
  .extern IOCIFCINV        /* 0xBF88647C */
  .extern DEVCFG3          /* 0xBFC00BF0 */
  .extern DEVCFG2          /* 0xBFC00BF4 */
  .extern DEVCFG1          /* 0xBFC00BF8 */
  .extern DEVCFG0          /* 0xBFC00BFC */
#else
#error Unknown language!
#endif

