codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx151f128h.h
#define _U1STA_URXISEL1_POSITION                 0x00000007
#define _U1STA_URXISEL1_MASK                     0x00000080
#define _U1STA_URXISEL1_LENGTH                   0x00000001

#define _U1STA_UTXISEL0_POSITION                 0x0000000E
#define _U1STA_UTXISEL0_MASK                     0x00004000
#define _U1STA_UTXISEL0_LENGTH                   0x00000001

#define _U1STA_UTXISEL1_POSITION                 0x0000000F
#define _U1STA_UTXISEL1_MASK                     0x00008000
#define _U1STA_UTXISEL1_LENGTH                   0x00000001

#define _U1STA_UTXSEL_POSITION                   0x0000000E
#define _U1STA_UTXSEL_MASK                       0x0000C000
#define _U1STA_UTXSEL_LENGTH                     0x00000002

#define _U1STA_w_POSITION                        0x00000000
#define _U1STA_w_MASK                            0xFFFFFFFF
#define _U1STA_w_LENGTH                          0x00000020

#define _AFECON_REGEN_POSITION                   0x00000000
#define _AFECON_REGEN_MASK                       0x00000001
#define _AFECON_REGEN_LENGTH                     0x00000001

#define _AFECON_VMIDEN_POSITION                  0x00000001
#define _AFECON_VMIDEN_MASK                      0x00000002
#define _AFECON_VMIDEN_LENGTH                    0x00000001

#define _AFECON_VDDO2EN_POSITION                 0x00000002
#define _AFECON_VDDO2EN_MASK                     0x00000004
#define _AFECON_VDDO2EN_LENGTH                   0x00000001

#define _AFECON_REFSEL_POSITION                  0x00000008
#define _AFECON_REFSEL_MASK                      0x00000300
#define _AFECON_REFSEL_LENGTH                    0x00000002

#define _AFECON_SIDL_POSITION                    0x0000000D
#define _AFECON_SIDL_MASK                        0x00002000
#define _AFECON_SIDL_LENGTH                      0x00000001

#define _AFECON_FRZ_POSITION                     0x0000000E
#define _AFECON_FRZ_MASK                         0x00004000
#define _AFECON_FRZ_LENGTH                       0x00000001

#define _AFECON_ON_POSITION                      0x0000000F
#define _AFECON_ON_MASK                          0x00008000
#define _AFECON_ON_LENGTH                        0x00000001

#define _AFECON_GTXEN_POSITION                   0x00000010
#define _AFECON_GTXEN_MASK                       0x00030000
#define _AFECON_GTXEN_LENGTH                     0x00000002

#define _AFECON_GTXPRE_POSITION                  0x00000014
#define _AFECON_GTXPRE_MASK                      0x00300000
#define _AFECON_GTXPRE_LENGTH                    0x00000002

#define _AFECON_GTXSLEN_POSITION                 0x00000018
#define _AFECON_GTXSLEN_MASK                     0x03000000
#define _AFECON_GTXSLEN_LENGTH                   0x00000002

#define _CVDTXEN0B_TX0_0_POSITION                0x00000010
#define _CVDTXEN0B_TX0_0_MASK                    0x00010000
#define _CVDTXEN0B_TX0_0_LENGTH                  0x00000001

#define _CVDTXEN0B_TX1_0_POSITION                0x00000011
#define _CVDTXEN0B_TX1_0_MASK                    0x00020000
#define _CVDTXEN0B_TX1_0_LENGTH                  0x00000001

#define _CVDTXEN0B_TX2_0_POSITION                0x00000012
#define _CVDTXEN0B_TX2_0_MASK                    0x00040000
#define _CVDTXEN0B_TX2_0_LENGTH                  0x00000001

#define _CVDTXEN0B_TX3_0_POSITION                0x00000013
#define _CVDTXEN0B_TX3_0_MASK                    0x00080000
#define _CVDTXEN0B_TX3_0_LENGTH                  0x00000001

#define _CVDTXEN0B_TX4_0_POSITION                0x00000014
#define _CVDTXEN0B_TX4_0_MASK                    0x00100000
#define _CVDTXEN0B_TX4_0_LENGTH                  0x00000001

#define _CVDTXEN0B_TX0_1_POSITION                0x00000015
#define _CVDTXEN0B_TX0_1_MASK                    0x00200000
#define _CVDTXEN0B_TX0_1_LENGTH                  0x00000001

#define _CVDTXEN0B_TX1_1_POSITION                0x00000016
#define _CVDTXEN0B_TX1_1_MASK                    0x00400000
#define _CVDTXEN0B_TX1_1_LENGTH                  0x00000001

#define _CVDTXEN0B_TX2_1_POSITION                0x00000017
#define _CVDTXEN0B_TX2_1_MASK                    0x00800000
#define _CVDTXEN0B_TX2_1_LENGTH                  0x00000001

#define _CVDTXEN0B_TX3_1_POSITION                0x00000018
#define _CVDTXEN0B_TX3_1_MASK                    0x01000000
#define _CVDTXEN0B_TX3_1_LENGTH                  0x00000001

#define _CVDTXEN0B_TX4_1_POSITION                0x00000019
#define _CVDTXEN0B_TX4_1_MASK                    0x02000000
#define _CVDTXEN0B_TX4_1_LENGTH                  0x00000001

#define _CVDTXEN0B_TX0_2_POSITION                0x0000001A
#define _CVDTXEN0B_TX0_2_MASK                    0x04000000
#define _CVDTXEN0B_TX0_2_LENGTH                  0x00000001

#define _CVDTXEN0B_TX1_2_POSITION                0x0000001B
#define _CVDTXEN0B_TX1_2_MASK                    0x08000000
#define _CVDTXEN0B_TX1_2_LENGTH                  0x00000001

#define _CVDTXEN0B_TX2_2_POSITION                0x0000001C
#define _CVDTXEN0B_TX2_2_MASK                    0x10000000
#define _CVDTXEN0B_TX2_2_LENGTH                  0x00000001

#define _CVDTXEN0B_TX3_2_POSITION                0x0000001D
#define _CVDTXEN0B_TX3_2_MASK                    0x20000000
#define _CVDTXEN0B_TX3_2_LENGTH                  0x00000001

#define _CVDTXEN0B_TX4_2_POSITION                0x0000001E
#define _CVDTXEN0B_TX4_2_MASK                    0x40000000
#define _CVDTXEN0B_TX4_2_LENGTH                  0x00000001

#define _CVDTXEN0B_TX0_3_POSITION                0x0000001F
#define _CVDTXEN0B_TX0_3_MASK                    0x80000000
#define _CVDTXEN0B_TX0_3_LENGTH                  0x00000001

#define _CVDTXEN1B_TX1_3_POSITION                0x00000000
#define _CVDTXEN1B_TX1_3_MASK                    0x00000001
#define _CVDTXEN1B_TX1_3_LENGTH                  0x00000001

#define _CVDTXEN1B_TX2_3_POSITION                0x00000001
#define _CVDTXEN1B_TX2_3_MASK                    0x00000002
#define _CVDTXEN1B_TX2_3_LENGTH                  0x00000001

#define _CVDTXEN1B_TX3_3_POSITION                0x00000002
#define _CVDTXEN1B_TX3_3_MASK                    0x00000004
#define _CVDTXEN1B_TX3_3_LENGTH                  0x00000001

#define _CVDTXEN1B_TX4_3_POSITION                0x00000003
#define _CVDTXEN1B_TX4_3_MASK                    0x00000008
#define _CVDTXEN1B_TX4_3_LENGTH                  0x00000001

