codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx151f128h.h
#define _CVDRXEN1B_RX2_8_POSITION                0x0000000A
#define _CVDRXEN1B_RX2_8_MASK                    0x00000400
#define _CVDRXEN1B_RX2_8_LENGTH                  0x00000001

#define _CVDRXEN1B_RX3_8_POSITION                0x0000000B
#define _CVDRXEN1B_RX3_8_MASK                    0x00000800
#define _CVDRXEN1B_RX3_8_LENGTH                  0x00000001

#define _CVDRXEN1B_RX4_8_POSITION                0x0000000C
#define _CVDRXEN1B_RX4_8_MASK                    0x00001000
#define _CVDRXEN1B_RX4_8_LENGTH                  0x00000001

#define _CVDRXEN1B_RX0_9_POSITION                0x0000000D
#define _CVDRXEN1B_RX0_9_MASK                    0x00002000
#define _CVDRXEN1B_RX0_9_LENGTH                  0x00000001

#define _CVDRXEN1B_RX1_9_POSITION                0x0000000E
#define _CVDRXEN1B_RX1_9_MASK                    0x00004000
#define _CVDRXEN1B_RX1_9_LENGTH                  0x00000001

#define _CVDRXEN1B_RX2_9_POSITION                0x0000000F
#define _CVDRXEN1B_RX2_9_MASK                    0x00008000
#define _CVDRXEN1B_RX2_9_LENGTH                  0x00000001

#define _CVDRXEN1B_RX3_9_POSITION                0x00000010
#define _CVDRXEN1B_RX3_9_MASK                    0x00010000
#define _CVDRXEN1B_RX3_9_LENGTH                  0x00000001

#define _CVDRXEN1B_RX4_9_POSITION                0x00000011
#define _CVDRXEN1B_RX4_9_MASK                    0x00020000
#define _CVDRXEN1B_RX4_9_LENGTH                  0x00000001

#define _CVDRXEN1B_RX0_10_POSITION               0x00000012
#define _CVDRXEN1B_RX0_10_MASK                   0x00040000
#define _CVDRXEN1B_RX0_10_LENGTH                 0x00000001

#define _CVDRXEN1B_RX1_10_POSITION               0x00000013
#define _CVDRXEN1B_RX1_10_MASK                   0x00080000
#define _CVDRXEN1B_RX1_10_LENGTH                 0x00000001

#define _CVDRXEN1B_RX2_10_POSITION               0x00000014
#define _CVDRXEN1B_RX2_10_MASK                   0x00100000
#define _CVDRXEN1B_RX2_10_LENGTH                 0x00000001

#define _CVDRXEN1B_RX3_10_POSITION               0x00000015
#define _CVDRXEN1B_RX3_10_MASK                   0x00200000
#define _CVDRXEN1B_RX3_10_LENGTH                 0x00000001

#define _CVDRXEN1B_RX4_10_POSITION               0x00000016
#define _CVDRXEN1B_RX4_10_MASK                   0x00400000
#define _CVDRXEN1B_RX4_10_LENGTH                 0x00000001

#define _REFCON0B_REFCON0_POSITION               0x00000000
#define _REFCON0B_REFCON0_MASK                   0x000000FF
#define _REFCON0B_REFCON0_LENGTH                 0x00000008

#define _REFCON0B_REFCON1_POSITION               0x00000008
#define _REFCON0B_REFCON1_MASK                   0x0000FF00
#define _REFCON0B_REFCON1_LENGTH                 0x00000008

#define _REFCON0B_REFCON2_POSITION               0x00000010
#define _REFCON0B_REFCON2_MASK                   0x00FF0000
#define _REFCON0B_REFCON2_LENGTH                 0x00000008

#define _REFCON0B_REFGAIN3_POSITION              0x00000018
#define _REFCON0B_REFGAIN3_MASK                  0xFF000000
#define _REFCON0B_REFGAIN3_LENGTH                0x00000008

#define _REFCON1B_REFGAIN4_POSITION              0x00000000
#define _REFCON1B_REFGAIN4_MASK                  0x000000FF
#define _REFCON1B_REFGAIN4_LENGTH                0x00000008

#define _CVDTXEN0S_TX0_0_POSITION                0x00000010
#define _CVDTXEN0S_TX0_0_MASK                    0x00010000
#define _CVDTXEN0S_TX0_0_LENGTH                  0x00000001

#define _CVDTXEN0S_TX1_0_POSITION                0x00000011
#define _CVDTXEN0S_TX1_0_MASK                    0x00020000
#define _CVDTXEN0S_TX1_0_LENGTH                  0x00000001

#define _CVDTXEN0S_TX2_0_POSITION                0x00000012
#define _CVDTXEN0S_TX2_0_MASK                    0x00040000
#define _CVDTXEN0S_TX2_0_LENGTH                  0x00000001

#define _CVDTXEN0S_TX3_0_POSITION                0x00000013
#define _CVDTXEN0S_TX3_0_MASK                    0x00080000
#define _CVDTXEN0S_TX3_0_LENGTH                  0x00000001

#define _CVDTXEN0S_TX4_0_POSITION                0x00000014
#define _CVDTXEN0S_TX4_0_MASK                    0x00100000
#define _CVDTXEN0S_TX4_0_LENGTH                  0x00000001

#define _CVDTXEN0S_TX0_1_POSITION                0x00000015
#define _CVDTXEN0S_TX0_1_MASK                    0x00200000
#define _CVDTXEN0S_TX0_1_LENGTH                  0x00000001

#define _CVDTXEN0S_TX1_1_POSITION                0x00000016
#define _CVDTXEN0S_TX1_1_MASK                    0x00400000
#define _CVDTXEN0S_TX1_1_LENGTH                  0x00000001

#define _CVDTXEN0S_TX2_1_POSITION                0x00000017
#define _CVDTXEN0S_TX2_1_MASK                    0x00800000
#define _CVDTXEN0S_TX2_1_LENGTH                  0x00000001

#define _CVDTXEN0S_TX3_1_POSITION                0x00000018
#define _CVDTXEN0S_TX3_1_MASK                    0x01000000
#define _CVDTXEN0S_TX3_1_LENGTH                  0x00000001

#define _CVDTXEN0S_TX4_1_POSITION                0x00000019
#define _CVDTXEN0S_TX4_1_MASK                    0x02000000
#define _CVDTXEN0S_TX4_1_LENGTH                  0x00000001

#define _CVDTXEN0S_TX0_2_POSITION                0x0000001A
#define _CVDTXEN0S_TX0_2_MASK                    0x04000000
#define _CVDTXEN0S_TX0_2_LENGTH                  0x00000001

#define _CVDTXEN0S_TX1_2_POSITION                0x0000001B
#define _CVDTXEN0S_TX1_2_MASK                    0x08000000
#define _CVDTXEN0S_TX1_2_LENGTH                  0x00000001

#define _CVDTXEN0S_TX2_2_POSITION                0x0000001C
#define _CVDTXEN0S_TX2_2_MASK                    0x10000000
#define _CVDTXEN0S_TX2_2_LENGTH                  0x00000001

#define _CVDTXEN0S_TX3_2_POSITION                0x0000001D
#define _CVDTXEN0S_TX3_2_MASK                    0x20000000
#define _CVDTXEN0S_TX3_2_LENGTH                  0x00000001

#define _CVDTXEN0S_TX4_2_POSITION                0x0000001E
#define _CVDTXEN0S_TX4_2_MASK                    0x40000000
#define _CVDTXEN0S_TX4_2_LENGTH                  0x00000001

#define _CVDTXEN0S_TX0_3_POSITION                0x0000001F
#define _CVDTXEN0S_TX0_3_MASK                    0x80000000
#define _CVDTXEN0S_TX0_3_LENGTH                  0x00000001

#define _CVDTXEN1S_TX1_3_POSITION                0x00000000
#define _CVDTXEN1S_TX1_3_MASK                    0x00000001
#define _CVDTXEN1S_TX1_3_LENGTH                  0x00000001

#define _CVDTXEN1S_TX2_3_POSITION                0x00000001
#define _CVDTXEN1S_TX2_3_MASK                    0x00000002
#define _CVDTXEN1S_TX2_3_LENGTH                  0x00000001

#define _CVDTXEN1S_TX3_3_POSITION                0x00000002
#define _CVDTXEN1S_TX3_3_MASK                    0x00000004
#define _CVDTXEN1S_TX3_3_LENGTH                  0x00000001

#define _CVDTXEN1S_TX4_3_POSITION                0x00000003
#define _CVDTXEN1S_TX4_3_MASK                    0x00000008
#define _CVDTXEN1S_TX4_3_LENGTH                  0x00000001

