codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx151f128h.h
#define _CH2CON_GRXBIASEN_POSITION               0x00000011
#define _CH2CON_GRXBIASEN_MASK                   0x00020000
#define _CH2CON_GRXBIASEN_LENGTH                 0x00000001

#define _CH2CON_BUFSEL_POSITION                  0x00000012
#define _CH2CON_BUFSEL_MASK                      0x00040000
#define _CH2CON_BUFSEL_LENGTH                    0x00000001

#define _CH2CON_FILTRST_POSITION                 0x00000014
#define _CH2CON_FILTRST_MASK                     0x00100000
#define _CH2CON_FILTRST_LENGTH                   0x00000001

#define _CH2CON_AUTOFRST_POSITION                0x00000015
#define _CH2CON_AUTOFRST_MASK                    0x00200000
#define _CH2CON_AUTOFRST_LENGTH                  0x00000001

#define _CH2CON_BUFEN_POSITION                   0x00000018
#define _CH2CON_BUFEN_MASK                       0x01000000
#define _CH2CON_BUFEN_LENGTH                     0x00000001

#define _CH2CON_RXFILTEN_POSITION                0x00000019
#define _CH2CON_RXFILTEN_MASK                    0x02000000
#define _CH2CON_RXFILTEN_LENGTH                  0x00000001

#define _CH2CON_REFATTEN_POSITION                0x0000001B
#define _CH2CON_REFATTEN_MASK                    0x08000000
#define _CH2CON_REFATTEN_LENGTH                  0x00000001

#define _CH2CON_REFFILTEN_POSITION               0x0000001C
#define _CH2CON_REFFILTEN_MASK                   0x10000000
#define _CH2CON_REFFILTEN_LENGTH                 0x00000001

#define _CH2CON_DIFFEN_POSITION                  0x0000001E
#define _CH2CON_DIFFEN_MASK                      0x40000000
#define _CH2CON_DIFFEN_LENGTH                    0x00000001

#define _CH3CON_DIFFGAIN_POSITION                0x00000000
#define _CH3CON_DIFFGAIN_MASK                    0x00000003
#define _CH3CON_DIFFGAIN_LENGTH                  0x00000002

#define _CH3CON_LPFILTSEL_POSITION               0x00000004
#define _CH3CON_LPFILTSEL_MASK                   0x000000F0
#define _CH3CON_LPFILTSEL_LENGTH                 0x00000004

#define _CH3CON_CVDEN_POSITION                   0x00000008
#define _CH3CON_CVDEN_MASK                       0x00000100
#define _CH3CON_CVDEN_LENGTH                     0x00000001

#define _CH3CON_CHPRE_POSITION                   0x00000009
#define _CH3CON_CHPRE_MASK                       0x00000200
#define _CH3CON_CHPRE_LENGTH                     0x00000001

#define _CH3CON_BIASEN_POSITION                  0x0000000A
#define _CH3CON_BIASEN_MASK                      0x00000400
#define _CH3CON_BIASEN_LENGTH                    0x00000001

#define _CH3CON_POLINV_POSITION                  0x0000000B
#define _CH3CON_POLINV_MASK                      0x00000800
#define _CH3CON_POLINV_LENGTH                    0x00000001

#define _CH3CON_DCAPSEL_POSITION                 0x0000000C
#define _CH3CON_DCAPSEL_MASK                     0x00003000
#define _CH3CON_DCAPSEL_LENGTH                   0x00000002

#define _CH3CON_DCAPPWR_POSITION                 0x0000000F
#define _CH3CON_DCAPPWR_MASK                     0x00008000
#define _CH3CON_DCAPPWR_LENGTH                   0x00000001

#define _CH3CON_GRXPRE_POSITION                  0x00000010
#define _CH3CON_GRXPRE_MASK                      0x00010000
#define _CH3CON_GRXPRE_LENGTH                    0x00000001

#define _CH3CON_GRXBIASEN_POSITION               0x00000011
#define _CH3CON_GRXBIASEN_MASK                   0x00020000
#define _CH3CON_GRXBIASEN_LENGTH                 0x00000001

#define _CH3CON_BUFSEL_POSITION                  0x00000012
#define _CH3CON_BUFSEL_MASK                      0x00040000
#define _CH3CON_BUFSEL_LENGTH                    0x00000001

#define _CH3CON_FILTRST_POSITION                 0x00000014
#define _CH3CON_FILTRST_MASK                     0x00100000
#define _CH3CON_FILTRST_LENGTH                   0x00000001

#define _CH3CON_AUTOFRST_POSITION                0x00000015
#define _CH3CON_AUTOFRST_MASK                    0x00200000
#define _CH3CON_AUTOFRST_LENGTH                  0x00000001

#define _CH3CON_BUFEN_POSITION                   0x00000018
#define _CH3CON_BUFEN_MASK                       0x01000000
#define _CH3CON_BUFEN_LENGTH                     0x00000001

#define _CH3CON_RXFILTEN_POSITION                0x00000019
#define _CH3CON_RXFILTEN_MASK                    0x02000000
#define _CH3CON_RXFILTEN_LENGTH                  0x00000001

#define _CH3CON_REFATTEN_POSITION                0x0000001B
#define _CH3CON_REFATTEN_MASK                    0x08000000
#define _CH3CON_REFATTEN_LENGTH                  0x00000001

#define _CH3CON_REFFILTEN_POSITION               0x0000001C
#define _CH3CON_REFFILTEN_MASK                   0x10000000
#define _CH3CON_REFFILTEN_LENGTH                 0x00000001

#define _CH3CON_DIFFEN_POSITION                  0x0000001E
#define _CH3CON_DIFFEN_MASK                      0x40000000
#define _CH3CON_DIFFEN_LENGTH                    0x00000001

#define _ADCOMCON1_G_SAMP_POSITION               0x00000001
#define _ADCOMCON1_G_SAMP_MASK                   0x00000002
#define _ADCOMCON1_G_SAMP_LENGTH                 0x00000001

#define _ADCOMCON1_G_ASAM_POSITION               0x00000002
#define _ADCOMCON1_G_ASAM_MASK                   0x0000000C
#define _ADCOMCON1_G_ASAM_LENGTH                 0x00000002

#define _ADCOMCON1_G_CLR_ASAM_POSITION           0x00000004
#define _ADCOMCON1_G_CLR_ASAM_MASK               0x00000010
#define _ADCOMCON1_G_CLR_ASAM_LENGTH             0x00000001

#define _ADCOMCON1_G_SSRC_POSITION               0x00000005
#define _ADCOMCON1_G_SSRC_MASK                   0x000000E0
#define _ADCOMCON1_G_SSRC_LENGTH                 0x00000003

#define _ADCOMCON1_FORM_POSITION                 0x00000008
#define _ADCOMCON1_FORM_MASK                     0x00000700
#define _ADCOMCON1_FORM_LENGTH                   0x00000003

#define _ADCOMCON1_DMABM_POSITION                0x0000000C
#define _ADCOMCON1_DMABM_MASK                    0x00001000
#define _ADCOMCON1_DMABM_LENGTH                  0x00000001

#define _ADCOMCON1_SIDL_POSITION                 0x0000000D
#define _ADCOMCON1_SIDL_MASK                     0x00002000
#define _ADCOMCON1_SIDL_LENGTH                   0x00000001

#define _ADCOMCON1_FRZ_POSITION                  0x0000000E
#define _ADCOMCON1_FRZ_MASK                      0x00004000
#define _ADCOMCON1_FRZ_LENGTH                    0x00000001

#define _ADCOMCON1_ON_POSITION                   0x0000000F
#define _ADCOMCON1_ON_MASK                       0x00008000
#define _ADCOMCON1_ON_LENGTH                     0x00000001

#define _ADCOMCON1_G_EN_POSITION                 0x00000010
#define _ADCOMCON1_G_EN_MASK                     0x001F0000
#define _ADCOMCON1_G_EN_LENGTH                   0x00000005

#define _ADCOMCON1_RESIDX_POSITION               0x00000018
#define _ADCOMCON1_RESIDX_MASK                   0x07000000
#define _ADCOMCON1_RESIDX_LENGTH                 0x00000003

#define _ADCOMCON2_OFFCAL_POSITION               0x0000000C
#define _ADCOMCON2_OFFCAL_MASK                   0x00001000
#define _ADCOMCON2_OFFCAL_LENGTH                 0x00000001

#define _ADCOMCON2_VCFG_POSITION                 0x0000000D
#define _ADCOMCON2_VCFG_MASK                     0x00006000
#define _ADCOMCON2_VCFG_LENGTH                   0x00000002

#define _ADCOMCON3_ADCS_POSITION                 0x00000000
#define _ADCOMCON3_ADCS_MASK                     0x000000FF
#define _ADCOMCON3_ADCS_LENGTH                   0x00000008

#define _ADCOMCON3_G_SAMC_POSITION               0x00000008
#define _ADCOMCON3_G_SAMC_MASK                   0x00001F00
#define _ADCOMCON3_G_SAMC_LENGTH                 0x00000005

#define _ADCOMCON3_ECLK_POSITION                 0x0000000E
#define _ADCOMCON3_ECLK_MASK                     0x00004000
#define _ADCOMCON3_ECLK_LENGTH                   0x00000001

#define _ADCOMCON3_ADRC_POSITION                 0x0000000F
#define _ADCOMCON3_ADRC_MASK                     0x00008000
#define _ADCOMCON3_ADRC_LENGTH                   0x00000001

#define _ADCOMCON3_RESET_POSITION                0x00000010
#define _ADCOMCON3_RESET_MASK                    0x00010000
#define _ADCOMCON3_RESET_LENGTH                  0x00000001

#define _ADCOMCON3_CLKOE_POSITION                0x00000011
#define _ADCOMCON3_CLKOE_MASK                    0x00020000
#define _ADCOMCON3_CLKOE_LENGTH                  0x00000001

#define _ADCOMCON3_HOLD_POSITION                 0x00000016
#define _ADCOMCON3_HOLD_MASK                     0x00400000
#define _ADCOMCON3_HOLD_LENGTH                   0x00000001

#define _ADCOMCON3_CLKRDY_POSITION               0x00000017
#define _ADCOMCON3_CLKRDY_MASK                   0x00800000
#define _ADCOMCON3_CLKRDY_LENGTH                 0x00000001

#define _ADCOMCON3_TSYNC_POSITION                0x00000018
#define _ADCOMCON3_TSYNC_MASK                    0x7F000000
#define _ADCOMCON3_TSYNC_LENGTH                  0x00000007

#define _AD0CON1_DONE_POSITION                   0x00000000
#define _AD0CON1_DONE_MASK                       0x00000001
#define _AD0CON1_DONE_LENGTH                     0x00000001

