codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx151f128h.h
#define _LATA_LATA1_POSITION                     0x00000001
#define _LATA_LATA1_MASK                         0x00000002
#define _LATA_LATA1_LENGTH                       0x00000001

#define _LATA_LATA2_POSITION                     0x00000002
#define _LATA_LATA2_MASK                         0x00000004
#define _LATA_LATA2_LENGTH                       0x00000001

#define _LATA_LATA3_POSITION                     0x00000003
#define _LATA_LATA3_MASK                         0x00000008
#define _LATA_LATA3_LENGTH                       0x00000001

#define _LATA_LATA4_POSITION                     0x00000004
#define _LATA_LATA4_MASK                         0x00000010
#define _LATA_LATA4_LENGTH                       0x00000001

#define _LATA_LATA7_POSITION                     0x00000007
#define _LATA_LATA7_MASK                         0x00000080
#define _LATA_LATA7_LENGTH                       0x00000001

#define _LATA_LATA8_POSITION                     0x00000008
#define _LATA_LATA8_MASK                         0x00000100
#define _LATA_LATA8_LENGTH                       0x00000001

#define _LATA_LATA9_POSITION                     0x00000009
#define _LATA_LATA9_MASK                         0x00000200
#define _LATA_LATA9_LENGTH                       0x00000001

#define _LATA_LATA10_POSITION                    0x0000000A
#define _LATA_LATA10_MASK                        0x00000400
#define _LATA_LATA10_LENGTH                      0x00000001

#define _LATA_w_POSITION                         0x00000000
#define _LATA_w_MASK                             0xFFFFFFFF
#define _LATA_w_LENGTH                           0x00000020

#define _ODCA_ODCA7_POSITION                     0x00000007
#define _ODCA_ODCA7_MASK                         0x00000080
#define _ODCA_ODCA7_LENGTH                       0x00000001

#define _ODCA_ODCA8_POSITION                     0x00000008
#define _ODCA_ODCA8_MASK                         0x00000100
#define _ODCA_ODCA8_LENGTH                       0x00000001

#define _ODCA_ODCA9_POSITION                     0x00000009
#define _ODCA_ODCA9_MASK                         0x00000200
#define _ODCA_ODCA9_LENGTH                       0x00000001

#define _ODCA_ODCA10_POSITION                    0x0000000A
#define _ODCA_ODCA10_MASK                        0x00000400
#define _ODCA_ODCA10_LENGTH                      0x00000001

#define _ODCA_w_POSITION                         0x00000000
#define _ODCA_w_MASK                             0xFFFFFFFF
#define _ODCA_w_LENGTH                           0x00000020

#define _IOCPUA_IOCPUA0_POSITION                 0x00000000
#define _IOCPUA_IOCPUA0_MASK                     0x00000001
#define _IOCPUA_IOCPUA0_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA1_POSITION                 0x00000001
#define _IOCPUA_IOCPUA1_MASK                     0x00000002
#define _IOCPUA_IOCPUA1_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA2_POSITION                 0x00000002
#define _IOCPUA_IOCPUA2_MASK                     0x00000004
#define _IOCPUA_IOCPUA2_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA3_POSITION                 0x00000003
#define _IOCPUA_IOCPUA3_MASK                     0x00000008
#define _IOCPUA_IOCPUA3_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA4_POSITION                 0x00000004
#define _IOCPUA_IOCPUA4_MASK                     0x00000010
#define _IOCPUA_IOCPUA4_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA7_POSITION                 0x00000007
#define _IOCPUA_IOCPUA7_MASK                     0x00000080
#define _IOCPUA_IOCPUA7_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA8_POSITION                 0x00000008
#define _IOCPUA_IOCPUA8_MASK                     0x00000100
#define _IOCPUA_IOCPUA8_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA9_POSITION                 0x00000009
#define _IOCPUA_IOCPUA9_MASK                     0x00000200
#define _IOCPUA_IOCPUA9_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA10_POSITION                0x0000000A
#define _IOCPUA_IOCPUA10_MASK                    0x00000400
#define _IOCPUA_IOCPUA10_LENGTH                  0x00000001

#define _IOCPUA_w_POSITION                       0x00000000
#define _IOCPUA_w_MASK                           0xFFFFFFFF
#define _IOCPUA_w_LENGTH                         0x00000020

#define _IOCPDA_IOCPDA0_POSITION                 0x00000000
#define _IOCPDA_IOCPDA0_MASK                     0x00000001
#define _IOCPDA_IOCPDA0_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA1_POSITION                 0x00000001
#define _IOCPDA_IOCPDA1_MASK                     0x00000002
#define _IOCPDA_IOCPDA1_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA2_POSITION                 0x00000002
#define _IOCPDA_IOCPDA2_MASK                     0x00000004
#define _IOCPDA_IOCPDA2_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA3_POSITION                 0x00000003
#define _IOCPDA_IOCPDA3_MASK                     0x00000008
#define _IOCPDA_IOCPDA3_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA4_POSITION                 0x00000004
#define _IOCPDA_IOCPDA4_MASK                     0x00000010
#define _IOCPDA_IOCPDA4_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA7_POSITION                 0x00000007
#define _IOCPDA_IOCPDA7_MASK                     0x00000080
#define _IOCPDA_IOCPDA7_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA8_POSITION                 0x00000008
#define _IOCPDA_IOCPDA8_MASK                     0x00000100
#define _IOCPDA_IOCPDA8_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA9_POSITION                 0x00000009
#define _IOCPDA_IOCPDA9_MASK                     0x00000200
#define _IOCPDA_IOCPDA9_LENGTH                   0x00000001

#define _IOCPDA_IOCPDA10_POSITION                0x0000000A
#define _IOCPDA_IOCPDA10_MASK                    0x00000400
#define _IOCPDA_IOCPDA10_LENGTH                  0x00000001

#define _IOCPDA_w_POSITION                       0x00000000
#define _IOCPDA_w_MASK                           0xFFFFFFFF
#define _IOCPDA_w_LENGTH                         0x00000020

#define _IOCCONA_SIDL_POSITION                   0x0000000D
#define _IOCCONA_SIDL_MASK                       0x00002000
#define _IOCCONA_SIDL_LENGTH                     0x00000001

