codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx151f128h.h
#define _LATB_LATB11_POSITION                    0x0000000B
#define _LATB_LATB11_MASK                        0x00000800
#define _LATB_LATB11_LENGTH                      0x00000001

#define _LATB_LATB13_POSITION                    0x0000000D
#define _LATB_LATB13_MASK                        0x00002000
#define _LATB_LATB13_LENGTH                      0x00000001

#define _LATB_LATB14_POSITION                    0x0000000E
#define _LATB_LATB14_MASK                        0x00004000
#define _LATB_LATB14_LENGTH                      0x00000001

#define _LATB_LATB15_POSITION                    0x0000000F
#define _LATB_LATB15_MASK                        0x00008000
#define _LATB_LATB15_LENGTH                      0x00000001

#define _LATB_w_POSITION                         0x00000000
#define _LATB_w_MASK                             0xFFFFFFFF
#define _LATB_w_LENGTH                           0x00000020

#define _ODCB_ODCB4_POSITION                     0x00000004
#define _ODCB_ODCB4_MASK                         0x00000010
#define _ODCB_ODCB4_LENGTH                       0x00000001

#define _ODCB_ODCB5_POSITION                     0x00000005
#define _ODCB_ODCB5_MASK                         0x00000020
#define _ODCB_ODCB5_LENGTH                       0x00000001

#define _ODCB_ODCB7_POSITION                     0x00000007
#define _ODCB_ODCB7_MASK                         0x00000080
#define _ODCB_ODCB7_LENGTH                       0x00000001

#define _ODCB_ODCB8_POSITION                     0x00000008
#define _ODCB_ODCB8_MASK                         0x00000100
#define _ODCB_ODCB8_LENGTH                       0x00000001

#define _ODCB_ODCB9_POSITION                     0x00000009
#define _ODCB_ODCB9_MASK                         0x00000200
#define _ODCB_ODCB9_LENGTH                       0x00000001

#define _ODCB_ODCB10_POSITION                    0x0000000A
#define _ODCB_ODCB10_MASK                        0x00000400
#define _ODCB_ODCB10_LENGTH                      0x00000001

#define _ODCB_ODCB11_POSITION                    0x0000000B
#define _ODCB_ODCB11_MASK                        0x00000800
#define _ODCB_ODCB11_LENGTH                      0x00000001

#define _ODCB_w_POSITION                         0x00000000
#define _ODCB_w_MASK                             0xFFFFFFFF
#define _ODCB_w_LENGTH                           0x00000020

#define _IOCPUB_IOCPUB0_POSITION                 0x00000000
#define _IOCPUB_IOCPUB0_MASK                     0x00000001
#define _IOCPUB_IOCPUB0_LENGTH                   0x00000001

#define _IOCPUB_IOCPUB1_POSITION                 0x00000001
#define _IOCPUB_IOCPUB1_MASK                     0x00000002
#define _IOCPUB_IOCPUB1_LENGTH                   0x00000001

#define _IOCPUB_IOCPUB2_POSITION                 0x00000002
#define _IOCPUB_IOCPUB2_MASK                     0x00000004
#define _IOCPUB_IOCPUB2_LENGTH                   0x00000001

#define _IOCPUB_IOCPUB3_POSITION                 0x00000003
#define _IOCPUB_IOCPUB3_MASK                     0x00000008
#define _IOCPUB_IOCPUB3_LENGTH                   0x00000001

#define _IOCPUB_IOCPUB4_POSITION                 0x00000004
#define _IOCPUB_IOCPUB4_MASK                     0x00000010
#define _IOCPUB_IOCPUB4_LENGTH                   0x00000001

#define _IOCPUB_IOCPUB5_POSITION                 0x00000005
#define _IOCPUB_IOCPUB5_MASK                     0x00000020
#define _IOCPUB_IOCPUB5_LENGTH                   0x00000001

#define _IOCPUB_IOCPUB7_POSITION                 0x00000007
#define _IOCPUB_IOCPUB7_MASK                     0x00000080
#define _IOCPUB_IOCPUB7_LENGTH                   0x00000001

#define _IOCPUB_IOCPUB8_POSITION                 0x00000008
#define _IOCPUB_IOCPUB8_MASK                     0x00000100
#define _IOCPUB_IOCPUB8_LENGTH                   0x00000001

#define _IOCPUB_IOCPUB9_POSITION                 0x00000009
#define _IOCPUB_IOCPUB9_MASK                     0x00000200
#define _IOCPUB_IOCPUB9_LENGTH                   0x00000001

#define _IOCPUB_IOCPUB10_POSITION                0x0000000A
#define _IOCPUB_IOCPUB10_MASK                    0x00000400
#define _IOCPUB_IOCPUB10_LENGTH                  0x00000001

#define _IOCPUB_IOCPUB11_POSITION                0x0000000B
#define _IOCPUB_IOCPUB11_MASK                    0x00000800
#define _IOCPUB_IOCPUB11_LENGTH                  0x00000001

#define _IOCPUB_IOCPUB13_POSITION                0x0000000D
#define _IOCPUB_IOCPUB13_MASK                    0x00002000
#define _IOCPUB_IOCPUB13_LENGTH                  0x00000001

#define _IOCPUB_IOCPUB14_POSITION                0x0000000E
#define _IOCPUB_IOCPUB14_MASK                    0x00004000
#define _IOCPUB_IOCPUB14_LENGTH                  0x00000001

#define _IOCPUB_IOCPUB15_POSITION                0x0000000F
#define _IOCPUB_IOCPUB15_MASK                    0x00008000
#define _IOCPUB_IOCPUB15_LENGTH                  0x00000001

#define _IOCPUB_w_POSITION                       0x00000000
#define _IOCPUB_w_MASK                           0xFFFFFFFF
#define _IOCPUB_w_LENGTH                         0x00000020

#define _IOCPDB_IOCPDB0_POSITION                 0x00000000
#define _IOCPDB_IOCPDB0_MASK                     0x00000001
#define _IOCPDB_IOCPDB0_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB1_POSITION                 0x00000001
#define _IOCPDB_IOCPDB1_MASK                     0x00000002
#define _IOCPDB_IOCPDB1_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB2_POSITION                 0x00000002
#define _IOCPDB_IOCPDB2_MASK                     0x00000004
#define _IOCPDB_IOCPDB2_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB3_POSITION                 0x00000003
#define _IOCPDB_IOCPDB3_MASK                     0x00000008
#define _IOCPDB_IOCPDB3_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB4_POSITION                 0x00000004
#define _IOCPDB_IOCPDB4_MASK                     0x00000010
#define _IOCPDB_IOCPDB4_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB5_POSITION                 0x00000005
#define _IOCPDB_IOCPDB5_MASK                     0x00000020
#define _IOCPDB_IOCPDB5_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB7_POSITION                 0x00000007
#define _IOCPDB_IOCPDB7_MASK                     0x00000080
#define _IOCPDB_IOCPDB7_LENGTH                   0x00000001

#define _IOCPDB_IOCPDB8_POSITION                 0x00000008
#define _IOCPDB_IOCPDB8_MASK                     0x00000100
#define _IOCPDB_IOCPDB8_LENGTH                   0x00000001

